<table align="left" width=100%>
    <tr>
        <td width="12%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="center">
                <font color="#21618C" size=8px>
                    <b>Advanced Python Programming <br> (Day 2) </b>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table align="left">
  <td>
    <a href="https://colab.research.google.com/github/vidyadharbendre/learn_advanced_python_using_examples/blob/main/notebooks/Advanced/advanced_python_programming_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>
  </td>
  <td>
    <a target="_blank" href="https://kaggle.com/kernels/welcome?src=https://github.com/vidyadharbendre/learn_advanced_python_using_examples/blob/main/notebooks/Advanced/advanced_python_programming_2.ipynb"><img src="https://kaggle.com/static/images/open-in-kaggle.svg" /></a>
  </td>
 <td>
    <a target="_blank" href="https://github.com/vidyadharbendre/learn_advanced_python_using_examples/blob/main/notebooks/Advanced/advanced_python_programming_2.ipynb">
      <img src="https://img.shields.io/badge/Open%20in-GitHub-100000?style=flat&logo=github&logoColor=white" alt="Open in GitHub"/>
    </a>
  </td>

</table>

In [1]:
import os
import numpy as np
import pandas as pd

In [2]:
# How to access the current working directory

import os
os.getcwd()

'/Users/vidyadharbendre/workspace/advanced_python/learn_advanced_python_using_examples/notebooks/Advanced'

In [3]:
!pip show pandas

Name: pandas
Version: 2.2.2
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author:
Author-email: The Pandas Development Team <pandas-dev@python.org>
License: BSD 3-Clause License

        Copyright (c) 2008-2011, AQR Capital Management, LLC, Lambda Foundry, Inc. and PyData Development Team
        All rights reserved.

        Copyright (c) 2011-2023, Open source contributors.

        Redistribution and use in source and binary forms, with or without
        modification, are permitted provided that the following conditions are met:

        * Redistributions of source code must retain the above copyright notice, this
          list of conditions and the following disclaimer.

        * Redistributions in binary form must reproduce the above copyright notice,
          this list of conditions and the following disclaimer in the documentation
          and/or other materials provided with the distribution.

        * Neither the name of the copyright holder nor the names of its
          contributors may be used to endorse or promote products derived from
          this software without specific prior written permission.

        THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
        AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
        IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
        DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
        FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
        DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
        SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
        CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
        OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
        OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
Location: /Users/vidyadharbendre/miniforge3/envs/nndl_env/lib/python3.9/site-packages

Required-by: camelot-py, object-detection, seaborn, statsmodels, streamlit

In [4]:
#!conda install pandas
# or
#!pip install pandas

In [5]:
import pandas as pd

## Table of Content.
1. **[Series](#Series)**
2. **[Data Structures with Examples](#Data_Structures)**
3. **[Create and Manipulate the Data Frames](#create_manipulate)**
4. **[Sorting](#sorting)**
5. **[Ranking](#ranking)**

### Let's begin with some hands-on practice exercises.

<a id='Series'></a>
## 1. Series Data Structures with Examples

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>0. Series and Data Frames
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [6]:
#marks obtained in PCMB
my_marks = [80, 50, 98, 79]
my_marks

[80, 50, 98, 79]

In [7]:
pd.Series()

Series([], dtype: object)

In [8]:
pd.Series(my_marks)

0    80
1    50
2    98
3    79
dtype: int64

In [9]:
s1 = pd.Series(my_marks)
print(type(s1))
print()
print(s1)

<class 'pandas.core.series.Series'>

0    80
1    50
2    98
3    79
dtype: int64

In [10]:
#dir(s1) - This is to understand the everything about s1 (series data)

In [11]:
s1.values

array([80, 50, 98, 79])

In [12]:
type(s1.values)

numpy.ndarray

In [13]:
print(s1.values)
print()
print(type(s1.values))

[80 50 98 79]

<class 'numpy.ndarray'>

In [14]:
my_marks = [80, 50, 98, 79]
s1 = pd.Series(my_marks)
print(type(s1))
print()
print(s1)
print()
print(type(s1.values))
print()
print(s1.ndim)
print()
print(s1.shape)
print()
print(s1.index)

<class 'pandas.core.series.Series'>

0    80
1    50
2    98
3    79
dtype: int64

<class 'numpy.ndarray'>

1

(4,)

RangeIndex(start=0, stop=4, step=1)

In [15]:
my_marks = [80, 50, 98, 79]
my_marks

[80, 50, 98, 79]

In [16]:
pd.Series(my_marks)

0    80
1    50
2    98
3    79
dtype: int64

In [17]:
my_marks = [80, 50, 98, 79]
s1 = pd.Series(my_marks, index=['Physics', 'Chemistry', 'Maths', 'Biology'])
print(type(s1))
print()
print(s1)
print()
print(type(s1.values))
print()
print(s1.ndim)
print()
print(s1.shape)
print()
print(s1.index)

<class 'pandas.core.series.Series'>

Physics      80
Chemistry    50
Maths        98
Biology      79
dtype: int64

<class 'numpy.ndarray'>

1

(4,)

Index(['Physics', 'Chemistry', 'Maths', 'Biology'], dtype='object')

In [18]:
s1.index

Index(['Physics', 'Chemistry', 'Maths', 'Biology'], dtype='object')

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>0. Write a Python program to depict the share prices of Tata, Birla, Wipro, and Infosys for the given share_prices = [850, 720, 410, 1650]
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [19]:
import pandas as pd

# Define share prices
share_prices = [850, 720, 410, 1650]  # Example share prices

# Create a Pandas Series with company names as index
s1 = pd.Series(share_prices, index=['Tata', 'Birla', 'Wipro', 'Infosys'])

# Print the type of the Series
print(type(s1))
print()

# Print the Series
print(s1)
print()

# Print the type of values
print(type(s1.values))
print()

# Print the number of dimensions
print(s1.ndim)
print()

# Print the shape of the Series
print(s1.shape)
print()

# Print the index labels
print(s1.index)

<class 'pandas.core.series.Series'>

Tata        850
Birla       720
Wipro       410
Infosys    1650
dtype: int64

<class 'numpy.ndarray'>

1

(4,)

Index(['Tata', 'Birla', 'Wipro', 'Infosys'], dtype='object')

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>1. Write a Python program to depict the share prices of Tata, Birla, Wipro, and Infosys using dictionary = [850, 720, 410, 1650]
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [20]:
#dictionary = {key:<value>}

In [21]:
#by default - when you pass dictionary - key elements becomes index in series

In [22]:
d1 = {'Tata': 850, 'Birla': 720, 'Wipro': 410, 'Infyosys': 1650}
sd1 = pd.Series(d1)
sd1

Tata         850
Birla        720
Wipro        410
Infyosys    1650
dtype: int64

In [23]:
print(sd1.index)
print()
print(sd1.values)

Index(['Tata', 'Birla', 'Wipro', 'Infyosys'], dtype='object')

[ 850  720  410 1650]

In [24]:
# by passing the key, returns the respective value for that key
sd1['Tata']

850

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>2. Write a Python program to access share prices of Tata, Birla, Wipro, and Infosys using dictionary = [850, 720, 410, 1650]
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [25]:
# access through numeric index
sd1[0]

/var/folders/kd/yddgdhm92qxgkw2js4t89ksr0000gn/T/ipykernel_76463/3727203515.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sd1[0]

850

In [26]:
sd1

Tata         850
Birla        720
Wipro        410
Infyosys    1650
dtype: int64

In [27]:
sd1.iloc[3]

1650

In [28]:
# access through numeric index (to access row values)
sd1.iloc[0]

850

In [29]:
#access through string index
sd1['Wipro':'Infyosys'] # if string slice, the endpoint is included

Wipro        410
Infyosys    1650
dtype: int64

In [30]:
sd1[2:4]

Wipro        410
Infyosys    1650
dtype: int64

In [31]:
#access through string index
sd1['Wipro':]

Wipro        410
Infyosys    1650
dtype: int64

In [32]:
sd1

Tata         850
Birla        720
Wipro        410
Infyosys    1650
dtype: int64

In [33]:
sd1[1:3] #if it is numerical slice, endpoint is excluded

Birla    720
Wipro    410
dtype: int64

In [34]:
sd1

Tata         850
Birla        720
Wipro        410
Infyosys    1650
dtype: int64

In [35]:
sd1[['Tata', 'Wipro']]

Tata     850
Wipro    410
dtype: int64

In [36]:
#access individual through vector of labels
sd1[['Tata', 'Wipro']]

Tata     850
Wipro    410
dtype: int64

In [37]:
# conditional access
sd1>750

Tata         True
Birla       False
Wipro       False
Infyosys     True
dtype: bool

In [38]:
sd1[sd1>750]

Tata         850
Infyosys    1650
dtype: int64

In [39]:
#value_count returns series
my_marks_dictionary = {'Physics':80, 'Chemistry':50, 'Maths':80, 'Biology':79, 'Statstics': 80}
s2 = pd.Series(my_marks_dictionary)
print(type(s2))
print()
print(s2)
print()
print(type(s2.values))
print()
print(s2.ndim)
print()
print(s2.shape)
print()
print(s2.index)
print()
print(s2.value_counts())

<class 'pandas.core.series.Series'>

Physics      80
Chemistry    50
Maths        80
Biology      79
Statstics    80
dtype: int64

<class 'numpy.ndarray'>

1

(5,)

Index(['Physics', 'Chemistry', 'Maths', 'Biology', 'Statstics'], dtype='object')

80    3
50    1
79    1
Name: count, dtype: int64

In [40]:
s2.value_counts()

80    3
50    1
79    1
Name: count, dtype: int64

In [41]:
#Summarize: Pandas - (1) Series 

#1. list as a parameter
#2. explicitely assign values to index
#3. dictionary as a parameter
#4. keys becomes indexes by default
#5. internally it stores as ndarry (numpy)
#6. value_counts (frequencies/occurances of each value)
#7. string slicing (end point included) vs numeric slicing (end point excluded)
#8. accessing as a vector [[]] - enclosed within two double quotes
#9. dir(object) - get to see the entire details about the object

<a id='Data_Structures'></a>
## 2. Data Structures with Examples

In [64]:
import pandas as pd

In [66]:
md1 = {
    "Min" : [40, 40, 40, 40],
    "Max": [100, 100, 100, 100],
    "Actual": [82, 95, 81, 93]
}
md1

{'Min': [40, 40, 40, 40],
 'Max': [100, 100, 100, 100],
 'Actual': [82, 95, 81, 93]}

In [59]:
row_labels = ['P', 'C', 'M', 'B']
row_labels

['P', 'C', 'M', 'B']

In [60]:
df = pd.DataFrame(data=md1, index=row_labels)
df

   Min  Max  Actual
P   40  100      82
C   40  100      95
M   40  100      81
B   40  100      93

In [61]:
type(df['Actual'])

pandas.core.series.Series

In [266]:
df.Actual.value_counts()

Actual
80    2
50    1
79    1
Name: count, dtype: int64

In [269]:
df.index

Index(['P', 'C', 'M', 'B'], dtype='object')

In [270]:
df.columns

Index(['Min', 'Max', 'Actual'], dtype='object')

In [271]:
df

   Min  Max  Actual
P   40  100      80
C   40  100      50
M   40  100      80
B   40  100      79

In [264]:
#dir(df)

['Actual',
 'Max',
 'Min',
 'T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__arrow_c_stream__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__dataframe__',
 '__dataframe_consortium_standard__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pandas_priority__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_align_for_op',
 '_align_frame',
 '_align_series',
 '_append',
 '_arith_method',
 '_arith_method_with_reindex',
 '_as_manager',
 '_attrs',
 '_box_col_values',
 '_can_fast_transpose',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_result',
 '_constructor',
 '_constructor_from_mgr',
 '_constructor_sliced',
 '_constructor_sliced_from_mgr',
 '_create_data_for_split_and_tight_to_dict',
 '_data',
 '_deprecate_downcast',
 '_dir_additions',
 '_dir_deletions',
 '_dispatch_frame_op',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_flags',
 '_flex_arith_method',
 '_flex_cmp_method',
 '_from_arrays',
 '_from_mgr',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values_for_csv',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_getitem_nocopy',
 '_getitem_slice',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_is_view_after_cow_rules',
 '_iset_item',
 '_iset_item_mgr',
 '_iset_not_inplace',
 '_item_cache',
 '_iter_column_arrays',
 '_ixs',
 '_logical_func',
 '_logical_method',
 '_maybe_align_series_as_frame',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_needs_reindex_multi',
 '_pad_or_backfill',
 '_protect_consolidate',
 '_reduce',
 '_reduce_axis1',
 '_reindex_axes',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_rename',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_series',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_item',
 '_set_item_frame_value',
 '_set_item_mgr',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_shift_with_freq',
 '_should_reindex_frame_op',
 '_slice',
 '_stat_function',
 '_stat_function_ddof',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_to_latex_via_styler',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isetitem',
 'isin',
 'isna',
 'isnull',
 'items',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_flags',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_orc',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'to_xml',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

In [62]:
#Creation of dataframe using dictionary

md1 = {'Min': [40, 40, 40, 40], 'Max': [100, 100, 100, 100], 'Actual': [80, 50, 80, 79] }
md1

{'Min': [40, 40, 40, 40],
 'Max': [100, 100, 100, 100],
 'Actual': [80, 50, 80, 79]}

In [63]:
mdf1 = pd.DataFrame(md1)
print(mdf1)

   Min  Max  Actual
0   40  100      80
1   40  100      50
2   40  100      80
3   40  100      79

In [73]:
#keys becomes column headings

In [74]:
#value_count returns series

md1 = {'Min': [40, 40, 40, 40], 'Max': [100, 100, 100, 100], 'Actual': [80, 50, 80, 79] }
row_label = ['Physics', 'Chemistry', 'Maths', 'Biology']
mdf1 = pd.DataFrame(md1, index=row_label)
print(mdf1)

           Min  Max  Actual
Physics     40  100      80
Chemistry   40  100      50
Maths       40  100      80
Biology     40  100      79

In [75]:
print(mdf1.shape)
print()
print(mdf1.index)
print()
print(mdf1.columns)

(4, 3)

Index(['Physics', 'Chemistry', 'Maths', 'Biology'], dtype='object')

Index(['Min', 'Max', 'Actual'], dtype='object')

In [72]:
mdf1.shape

(4, 3)

In [83]:
data_list = [ [40, 100, 80],
              [40, 100, 50],  
              [40, 100, 80],
              [40, 100, 79]]
data_list
df = pd.DataFrame(data_list)
df

    0    1   2
0  40  100  80
1  40  100  50
2  40  100  80
3  40  100  79

In [84]:
row_label = ['Physics', 'Chemistry', 'Maths', 'Biology']
col_label = ['Min', 'Max', 'Actual']

In [85]:
df2 = pd.DataFrame(data=data_list, index=row_label, columns=col_label)
df2

           Min  Max  Actual
Physics     40  100      80
Chemistry   40  100      50
Maths       40  100      80
Biology     40  100      79

In [86]:
import numpy as np

In [67]:
np.random.seed(42)
np.random.randint(10, 100, size=(4, 3))

array([[61, 24, 81],
       [70, 30, 92],
       [96, 84, 84],
       [97, 33, 12]])

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left" style="font-size:120%">
                <font color="#21618C">
                    <b>0. How can I use NumPy to generate a table with random marks for subjects where the minimum score is 40 and the maximum is 100, ensuring that the output follows this format?</b>
                </font>
            </div>
        </td>
    </tr>
</table>

<br>

<table border="1">
    <tr>
        <th>Subject</th>
        <th>Min</th>
        <th>Max</th>
        <th>Actual</th>
    </tr>
    <tr>
        <td>Physics</td>
        <td>40</td>
        <td>100</td>
        <td>80</td>
    </tr>
    <tr>
        <td>Chemistry</td>
        <td>40</td>
        <td>100</td>
        <td>50</td>
    </tr>
    <tr>
        <td>Maths</td>
        <td>40</td>
        <td>100</td>
        <td>80</td>
    </tr>
    <tr>
        <td>Biology</td>
        <td>40</td>
        <td>100</td>
        <td>79</td>
    </tr>
</table>

<p>The "Actual" column should contain randomly generated values between 40 and 100 for each subject.</p>

In [88]:
import numpy as np
import pandas as pd

# Define subjects and their min/max values
subjects = ['Physics', 'Chemistry', 'Maths', 'Biology']
min_marks = 40
max_marks = 100

# Generate random marks between min and max
actual_marks = np.random.randint(min_marks, max_marks + 1, size=len(subjects))

# Create DataFrame
df = pd.DataFrame({
    'Subject': subjects,
    'Min': min_marks,
    'Max': max_marks,
    'Actual': actual_marks
})

print(df)

     Subject  Min  Max  Actual
0    Physics   40  100      72
1  Chemistry   40  100      70
2      Maths   40  100      79
3    Biology   40  100      69

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>1. Write a program to convert given array to an ordinary list with the same items
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below array:**<br>
array1 = array('b', [21,23,63,74])

In [3]:
# write your code here
from array import array

array1 = array('b', [21,23,63,74])

ord_list = array1.tolist()
print(ord_list)

[21, 23, 63, 74]

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>2. Extract second word from the given string
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below string:**<br>
string = 'Be confident and be yourself'

In [4]:
# write your code here

string = 'Wholehearted EFFORT yields the best results'

a = string.split()

second_word = a[1]

# Print the second word
print(f'The second word in the given sentence is.......: {second_word}')

The second word in the given sentence is.......: EFFORT

<a id='create_manipulate'></a>
## 2. Create and Manipulate the Data Frames

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>3. Split a 'Name' column into two seperate columns <b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [77]:
df = pd.DataFrame({"Name": ['Shreyas', 'LokRanjan', 'Harshvardhan', 'Kharanshu', 'Sakshi', 'Surakha', 'Surabhi'], 
"Salary": [8989, 9890, 7689, 9898, 8767, 8907, 7869]})
df

           Name  Salary
0       Shreyas    8989
1     LokRanjan    9890
2  Harshvardhan    7689
3     Kharanshu    9898
4        Sakshi    8767
5       Surakha    8907
6       Surabhi    7869

In [82]:
# displays top 5 rows of a dataframe
df.head()

           Name  Salary
0       Shreyas    8989
1     LokRanjan    9890
2  Harshvardhan    7689
3     Kharanshu    9898
4        Sakshi    8767

In [81]:
# displays bottom 5 rows
df.tail()

           Name  Salary
2  Harshvardhan    7689
3     Kharanshu    9898
4        Sakshi    8767
5       Surakha    8907
6       Surabhi    7869

**Use the below data frame:**<br>
df = pd.DataFrame({'Name': ['Vidyadhar Bendre', 'Akshara Bendre', 'Atharva Bendre', 'Poornima Bendre'],<br> 
                   'Salary':[3200, 4500, 3600, 5596]})

In [5]:
# write your code here
import pandas as pd

In [6]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [7]:
pd.DataFrame({'Name': ['Vidyadhar Bendre', 'Akshara Bendre', 'Atharva Bendre', 'Poornima Bendre'],
'Salary':[3200, 4500, 3600, 5596]})

               Name  Salary
0  Vidyadhar Bendre    3200
1    Akshara Bendre    4500
2    Atharva Bendre    3600
3   Poornima Bendre    5596

In [75]:
df = pd.DataFrame({'Name': ['Vidyadhar Bendre', 'Akshara Bendre', 'Atharva Bendre', 'Poornima Bendre', 'Shashikanth Bendre', 'Meena Bendre', 'Vivek Bendre', 'Veena Bendre', 'Vijay Bendre'],
'Salary':[3200, 4500, 3600, 5596, 6785, 6754, 7865, 1234, 8907]})

In [71]:
df

           Name  Salary
0       Shreyas    8989
1     LokRanjan    9890
2  Harshvardhan    7689
3     Kharanshu    9898

In [74]:
#dir(df)

In [72]:
df.columns

Index(['Name', 'Salary'], dtype='object')

In [9]:
df.columns

Index(['Name', 'Salary'], dtype='object')

In [10]:
df.head()

                 Name  Salary
0    Vidyadhar Bendre    3200
1      Akshara Bendre    4500
2      Atharva Bendre    3600
3     Poornima Bendre    5596
4  Shashikanth Bendre    6785

In [11]:
df.tail()

                 Name  Salary
4  Shashikanth Bendre    6785
5        Meena Bendre    6754
6        Vivek Bendre    7865
7        Veena Bendre    1234
8        Vijay Bendre    8907

In [89]:
df = pd.DataFrame({"Name": ['Shreyas M', 'LokRanjan Sri', 'Harshvardhan Kaiwar', 'Kharanshu Sharma', 'Sakshi Bendre', 'Surakha Mandi', 'Surabhi Kulkarni'], 
"Salary": [8989, 9890, 7689, 9898, 8767, 8907, 7869]})
df

                  Name  Salary
0            Shreyas M    8989
1        LokRanjan Sri    9890
2  Harshvardhan Kaiwar    7689
3     Kharanshu Sharma    9898
4        Sakshi Bendre    8767
5        Surakha Mandi    8907
6     Surabhi Kulkarni    7869

In [90]:
df.columns

Index(['Name', 'Salary'], dtype='object')

In [92]:
df

                  Name  Salary
0            Shreyas M    8989
1        LokRanjan Sri    9890
2  Harshvardhan Kaiwar    7689
3     Kharanshu Sharma    9898
4        Sakshi Bendre    8767
5        Surakha Mandi    8907
6     Surabhi Kulkarni    7869

In [93]:
df.Name.str.split()

0              [Shreyas, M]
1          [LokRanjan, Sri]
2    [Harshvardhan, Kaiwar]
3       [Kharanshu, Sharma]
4          [Sakshi, Bendre]
5          [Surakha, Mandi]
6       [Surabhi, Kulkarni]
Name: Name, dtype: object

In [95]:
df[['First_Name', 'Last_Name']] = df.Name.str.split(expand=True)
df

                  Name  Salary    First_Name Last_Name
0            Shreyas M    8989       Shreyas         M
1        LokRanjan Sri    9890     LokRanjan       Sri
2  Harshvardhan Kaiwar    7689  Harshvardhan    Kaiwar
3     Kharanshu Sharma    9898     Kharanshu    Sharma
4        Sakshi Bendre    8767        Sakshi    Bendre
5        Surakha Mandi    8907       Surakha     Mandi
6     Surabhi Kulkarni    7869       Surabhi  Kulkarni

In [86]:
df.Salary

0    8989
1    9890
2    7689
3    9898
4    8767
5    8907
6    7869
Name: Salary, dtype: int64

In [12]:
df[['First','Last']] = df.Name.str.split(expand=True)
df




#df['Name'] = df['Name'].str.split(' ')


#split_name = df['Name'].str.split(' ')
#data = split_name.to_list()
#names = ['First Name', 'Last Name']
#new_df = pd.DataFrame(data, columns=names)
#new_df

                 Name  Salary        First    Last
0    Vidyadhar Bendre    3200    Vidyadhar  Bendre
1      Akshara Bendre    4500      Akshara  Bendre
2      Atharva Bendre    3600      Atharva  Bendre
3     Poornima Bendre    5596     Poornima  Bendre
4  Shashikanth Bendre    6785  Shashikanth  Bendre
5        Meena Bendre    6754        Meena  Bendre
6        Vivek Bendre    7865        Vivek  Bendre
7        Veena Bendre    1234        Veena  Bendre
8        Vijay Bendre    8907        Vijay  Bendre

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>4. Select the rows from below data frame, whose marks is less than 60 <b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame:**<br>
df_student = pd.DataFrame({'Name': ['Vidyadhar', 'Poornima', 'Atharva', 'Akshara'],<br>
                           'Marks': [90, 50, 89, 55]<br>
})

In [13]:
# write your code here
import pandas as pd

In [14]:
pd.DataFrame({'Name': ['Vidyadhar', 'Poornima', 'Atharva', 'Akshara'],
'Marks': [90, 50, 89, 55]
})

        Name  Marks
0  Vidyadhar     90
1   Poornima     50
2    Atharva     89
3    Akshara     55

In [15]:
df_student = pd.DataFrame({'Name': ['Vidyadhar', 'Poornima', 'Atharva', 'Akshara'],
'Marks': [90, 50, 89, 55]
})

In [16]:
df_student[df_student.Marks >= 90]

        Name  Marks
0  Vidyadhar     90

In [17]:
df_student.Marks.mean()

71.0

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>5. Write a program to select the rows, where the sales are greater than 60000 for Mumbai location <b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [18]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

df_store[ (df_store.Sales > 60000) &  (df_store.Location == 'Mumbai')]

  Store Location  Sales
3     C   Mumbai  90000
8     C   Mumbai  89000

In [93]:
!ls -la

total 4560
drwxr-xr-x  16 vidyadharbendre  staff     512 Mar 13 07:54 .
drwxr-xr-x   8 vidyadharbendre  staff     256 May 28  2024 ..
-rw-r--r--@  1 vidyadharbendre  staff    8196 Mar  8 08:41 .DS_Store
drwxr-xr-x  11 vidyadharbendre  staff     352 Jul 22  2024 .ipynb_checkpoints
-rw-r--r--@  1 vidyadharbendre  staff  237793 May 19  2024 1600px-Sunflower_from_Silesia2.jpg
-rw-r--r--@  1 vidyadharbendre  staff   25225 Jul 20  2024 Additional_Examples.ipynb
drwxr-xr-x   4 vidyadharbendre  staff     128 Jul  2  2024 LeetCode_Examples
-rw-rw-r--@  1 vidyadharbendre  staff     377 Jan  6  2020 Supermarket.csv
-rw-------@  1 vidyadharbendre  staff  323787 Mar 10 07:00 advanced_python_programming_1.ipynb
-rw-r--r--@  1 vidyadharbendre  staff  121123 Mar 13 07:54 advanced_python_programming_2.ipynb
-rw-------@  1 vidyadharbendre  staff  143127 Mar 11 06:31 advanced_python_programming_3.ipynb
-rw-------@  1 vidyadharbendre  staff  949497 Jul 20  2024 advanced_python_programming_4.ipynb
-rw-r--r--   1 vidyadharbendre  staff     189 May  8  2024 df_store.csv
-rw-r--r--@  1 vidyadharbendre  staff    1007 Jul 22  2024 generate_secrete_key.ipynb
-rw-r--r--@  1 vidyadharbendre  staff  129251 Jul 20  2024 gradient_descent.ipynb
-rw-r--r--@  1 vidyadharbendre  staff  362861 Jul 20  2024 numpy_edge_detection.ipynb

In [94]:
#File Based DataFrames (csv - comma separated, excel, json files, html files)

In [23]:
import pandas as pd

In [96]:
# This is to show the all the files exists
!dir

zsh:1: command not found: dir

In [98]:
import os
os.getcwd()

'/Users/vidyadharbendre/workspace/advanced_python/learn_advanced_python_using_examples/notebooks/Advanced'

In [98]:
!ls

1600px-Sunflower_from_Silesia2.jpg  advanced_python_programming_4.ipynb
Additional_Examples.ipynb           df_store.csv
LeetCode_Examples                   generate_secrete_key.ipynb
Supermarket.csv                     gradient_descent.ipynb
advanced_python_programming_1.ipynb numpy_edge_detection.ipynb
advanced_python_programming_2.ipynb stock.csv
advanced_python_programming_3.ipynb

stock.csv

Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [101]:
#For Windows OS
!dir stock.csv

zsh:1: command not found: dir

In [103]:
#For unix or linux (iOS or Linux OS)
!ls -la stock.csv

-rw-r--r--@ 1 vidyadharbendre  staff  662 Mar 14 09:03 stock.csv

In [106]:
df = pd.read_csv("stock.csv")
df

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [104]:
pd.read_csv('stock.csv')

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [107]:
df_stock = pd.read_csv('stock.csv')
df_stock

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [111]:
#df_stock.transpose()

In [ ]:
# What is the profit - Rev - Exp
# What is the profit for public, Pvt and Govt companies

In [107]:
# Machine Learning Terminology

# rows as observations
# columns as features - numeric or categorical -
# every column is homogenious - same datatype through out
# overalll structure is hetrogenious

In [108]:
# top 5 rows
df_stock.head()

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009

In [ ]:
df_stock.head(3)

In [109]:
df_stock.tail()

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [110]:
df_stock.tail(3)

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [116]:
#1 df.shape - displays rows and columns in a tuple
df_stock.shape

(10, 10)

In [114]:
#2 - dataframe.info() - It display total entries, and data-type of each column
df_stock.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, TCS_Solutions to Persistent_Systems
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Vol         10 non-null     int64
 1   Rev         10 non-null     float64
 2   Exp         10 non-null     int64
 3   Sector      10 non-null     object
 4   EmpCnt      10 non-null     int64
 5   HQ          10 non-null     object
 6   MNC         10 non-null     int64
 7   StockID     10 non-null     object
 8   GST         10 non-null     int64
 9   Start Date  10 non-null     object
dtypes: float64(1), int64(5), object(4)
memory usage: 1.2+ KB

In [112]:
#default data type in pandas int64 - numberic data
#default data type in pandas object - categorical data

In [121]:
df_stock.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, TCS_Solutions to Persistent_Systems
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Vol         10 non-null     int64
 1   Rev         10 non-null     float64
 2   Exp         10 non-null     int64
 3   Sector      10 non-null     object
 4   EmpCnt      10 non-null     int64
 5   HQ          10 non-null     object
 6   MNC         10 non-null     int64
 7   StockID     10 non-null     object
 8   GST         10 non-null     int64
 9   Start Date  10 non-null     object
dtypes: float64(1), int64(5), object(4)
memory usage: 1.2+ KB

In [113]:
# summary statistics - df.describe - displays summary statistics
# Five Point Summary - describe
df_stock.describe()

              Vol         Rev         Exp         EmpCnt        MNC        GST
count   10.000000   10.000000   10.000000      10.000000  10.000000  10.000000
mean   949.500000  874.000000  678.000000  201500.000000   0.900000  11.000000
std     27.228457   51.549286   19.032137  161979.594051   0.316228   5.715476
min    910.000000  810.800000  650.000000   25000.000000   0.000000   5.000000
25%    928.750000  834.175000  666.250000   51500.000000   1.000000   5.000000
50%    947.500000  860.300000  677.500000  185500.000000   1.000000  12.000000
75%    967.500000  920.725000  688.750000  322000.000000   1.000000  16.500000
max    995.000000  950.300000  710.000000  500000.000000   1.000000  18.000000

In [133]:
df_stock

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [138]:
df_stock.Sector.unique()

array(['Pub', 'Pvt', 'Gov'], dtype=object)

In [137]:
# df.column_name.value_counts()
df_stock.Sector.value_counts()

Sector
Pub    4
Pvt    4
Gov    2
Name: count, dtype: int64

In [132]:
# For categorical data 
df_stock.describe(include=np.object_)

       Sector   HQ StockID Start Date
count      10   10      10         10
unique      3    5      10         10
top       Pub  Blr     TCS   Apr 2004
freq        4    4       1          1

In [131]:
df_stock.Vol.min(), df_stock.Vol.max()

(910, 995)

In [123]:
df_stock.Vol.sum()/10

949.5

In [120]:
df_stock.Vol.mean(), df_stock.Rev.mean()

(949.5, 874.0)

In [117]:
df_stock.describe(include=np.object_)

       Sector   HQ StockID Start Date
count      10   10      10         10
unique      3    5      10         10
top       Pub  Blr     TCS   Apr 2004
freq        4    4       1          1

In [118]:
df_stock.value_counts()

Vol  Rev    Exp  Sector  EmpCnt  HQ   MNC  StockID  GST  Start Date
910  810.8  650  Pvt     38000   Blr  1    MIND     18   Jan 2018      1
920  820.6  655  Gov     92000   Mum  1    LTI      18   Dec 2016      1
925  830.5  675  Pvt     38000   Blr  1    MPHS     5    Sep 2020      1
940  850.2  665  Pub     146000  Pun  1    TMAH     12   Mar 2009      1
945  845.2  685  Gov     25000   Pun  0    PRST     5    Apr 2021      1
950  870.4  670  Pvt     225000  NCR  1    HCLT     5    Aug 2007      1
960  890.5  680  Pub     250000  Blr  1    WIPR     5    Dec 2002      1
970  930.8  690  Pvt     346000  Blr  1    INFY     12   Jul 1999      1
980  950.3  700  Pub     500000  Mum  1    TCS      18   Apr 2004      1
995  940.7  710  Pub     355000  Chn  1    COGN     12   May 2019      1
Name: count, dtype: int64

In [119]:
df_stock.Sector.value_counts()

Sector
Pub    4
Pvt    4
Gov    2
Name: count, dtype: int64

In [139]:
# by default - it display numeric columns
df_stock.describe()

              Vol         Rev         Exp         EmpCnt        MNC        GST
count   10.000000   10.000000   10.000000      10.000000  10.000000  10.000000
mean   949.500000  874.000000  678.000000  201500.000000   0.900000  11.000000
std     27.228457   51.549286   19.032137  161979.594051   0.316228   5.715476
min    910.000000  810.800000  650.000000   25000.000000   0.000000   5.000000
25%    928.750000  834.175000  666.250000   51500.000000   1.000000   5.000000
50%    947.500000  860.300000  677.500000  185500.000000   1.000000  12.000000
75%    967.500000  920.725000  688.750000  322000.000000   1.000000  16.500000
max    995.000000  950.300000  710.000000  500000.000000   1.000000  18.000000

In [142]:
# displays categorical 
df_stock.describe(include = np.object_)

       Sector   HQ StockID Start Date
count      10   10      10         10
unique      3    5      10         10
top       Pub  Blr     TCS   Apr 2004
freq        4    4       1          1

In [143]:
# Five Point Summary - pd.describe
df_stock.describe(include='all')

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
count,10.000000,10.000000,10.000000,10,10.000000,10,10.000000,10,10.000000,10
unique,NaN,NaN,NaN,3,NaN,5,NaN,10,NaN,10
top,NaN,NaN,NaN,Pub,NaN,Blr,NaN,TCS,NaN,Apr 2004
freq,NaN,NaN,NaN,4,NaN,4,NaN,1,NaN,1
mean,949.500000,874.000000,678.000000,NaN,201500.000000,NaN,0.900000,NaN,11.000000,NaN
std,27.228457,51.549286,19.032137,NaN,161979.594051,NaN,0.316228,NaN,5.715476,NaN
min,910.000000,810.800000,650.000000,NaN,25000.000000,NaN,0.000000,NaN,5.000000,NaN
25%,928.750000,834.175000,666.250000,NaN,51500.000000,NaN,1.000000,NaN,5.000000,NaN
50%,947.500000,860.300000,677.500000,NaN,185500.000000,NaN,1.000000,NaN,12.000000,NaN
75%,967.500000,920.725000,688.750000,NaN,322000.000000,NaN,1.000000,NaN,16.500000,NaN
max,995.000000,950.300000,710.000000,NaN,500000.000000,NaN,1.000000,NaN,18.000000,NaN

In [146]:
# describe or five point summary is stored as dataframe
d = df_stock.describe()
d

              Vol         Rev         Exp         EmpCnt        MNC        GST
count   10.000000   10.000000   10.000000      10.000000  10.000000  10.000000
mean   949.500000  874.000000  678.000000  201500.000000   0.900000  11.000000
std     27.228457   51.549286   19.032137  161979.594051   0.316228   5.715476
min    910.000000  810.800000  650.000000   25000.000000   0.000000   5.000000
25%    928.750000  834.175000  666.250000   51500.000000   1.000000   5.000000
50%    947.500000  860.300000  677.500000  185500.000000   1.000000  12.000000
75%    967.500000  920.725000  688.750000  322000.000000   1.000000  16.500000
max    995.000000  950.300000  710.000000  500000.000000   1.000000  18.000000

In [122]:
d = df_stock.describe()
print(d)
print()
print(d.index)
print()
print(d.columns)

              Vol         Rev         Exp         EmpCnt        MNC        GST
count   10.000000   10.000000   10.000000      10.000000  10.000000  10.000000
mean   949.500000  874.000000  678.000000  201500.000000   0.900000  11.000000
std     27.228457   51.549286   19.032137  161979.594051   0.316228   5.715476
min    910.000000  810.800000  650.000000   25000.000000   0.000000   5.000000
25%    928.750000  834.175000  666.250000   51500.000000   1.000000   5.000000
50%    947.500000  860.300000  677.500000  185500.000000   1.000000  12.000000
75%    967.500000  920.725000  688.750000  322000.000000   1.000000  16.500000
max    995.000000  950.300000  710.000000  500000.000000   1.000000  18.000000

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

Index(['Vol', 'Rev', 'Exp', 'EmpCnt', 'MNC', 'GST'], dtype='object')

In [123]:
df_stock.describe(exclude=np.number)

       Sector   HQ StockID Start Date
count      10   10      10         10
unique      3    5      10         10
top       Pub  Blr     TCS   Apr 2004
freq        4    4       1          1

In [147]:
# convert dataframe into excel, html, json and csv format

In [ ]:
df_stock.to_excel()

In [125]:
df_stock.to_excel('1d_stock.xlsx')

In [128]:
df_stock.to_html('1d_stock.html')

In [129]:
df_stock.to_json('1d_stock.json')

In [130]:
df_stock.to_csv('1d_stock.csv')

In [149]:
!dir 1d*

zsh:1: command not found: dir

In [148]:
!ls -la 1d*

-rw-r--r--@ 1 vidyadharbendre  staff   663 Mar 13 20:38 1d_stock.csv
-rw-r--r--@ 1 vidyadharbendre  staff  2801 Mar 13 20:35 1d_stock.html
-rw-r--r--@ 1 vidyadharbendre  staff  2207 Mar 13 20:36 1d_stock.json
-rw-r--r--@ 1 vidyadharbendre  staff  9515 Mar 17 19:45 1d_stock.xlsx

In [150]:
pd.read_excel('1d_stock.xlsx')

,Unnamed: 0,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
0,TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
1,Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
2,Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
3,HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
4,TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
5,LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
6,Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
7,Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
8,Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
9,Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [134]:
pd.read_excel('1d_stock.xlsx', index_col=0)

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [137]:
dfh = pd.read_html('1d_stock.html', index_col=0)
dfh[0]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [138]:
pd.read_json('1d_stock.json')

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [ ]:
#Summary:
 
#1. creating dataframe from list, dictionary
#2. df.shape - rows and columns
#3. df.info() - total number of records and data type of each column
#4. df.describe - Five Point Summary - mean, std, count, min and max
#5. df.describe() - default - displays numerical columns
#6. df.describe(include = np.objects_) - categorical columns
#7. df.describe(include = 'all')
#8. convert dataframe into different file types - df.to_execl(), df.to_csv(), df.to_html()...
#9. retrive different file types - pd.read_csv, pd.read_excel, pd.read_json, pd.read_html
#10. except json, row_index = 0 while reading different file types - first column into row index

In [145]:
#import PyPDF2

In [272]:
# Dataframe Access

#1. Direct Access 
# access columns
#    - df[<col_label] - df_stock['Exp']
#    - df[<vector of column labels>] - df_stock[['Vol', 'GST']]
# access rows
#    - df[<slicing of row labels>] - df_stock['TCS_Solutions':'Mindtree_Ltd']

#2. Integer Location Access(iloc)
#    - df.iloc[row_numeric_index] - df_stock.iloc[0] - returns a particular row for all the columns data
#    - df.iloc[row_numeric_index, col_numeric_index]
#
#    - df.iloc[row_numeric_slice]
#    - df.iloc[row_numberic_slice, col_numeric_slice]
#    
#    - df.iloc[[row_numeric_idices]] - list of rows as vectors
#    - df.iloc[[row_numeric_indices],[column_numeric_indices]] # from the selected rows, pick the columns
#
#    - combination of the above
#3. Labelled/Location Base Access
#    - iloc - does not allow labelled access
#    - df.loc[row_label]
#    - df.loc[row_label, column_label]

#    - df.loc[row_label_slice]
#    - df.loc[row_label_slice, col_label_slice]

#    - df.loc[[row_label_indices]]
#    - df.loc[[row_label_indices], [col_label_indices]]

In [173]:
df_stock.iloc[0]

Vol                980
Rev              950.3
Exp                700
Sector             Pub
EmpCnt          500000
HQ                 Mum
MNC                  1
StockID            TCS
GST                 18
Start Date    Apr 2004
Name: TCS_Solutions, dtype: object

In [146]:
df_stock

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [152]:
#dir(df_stock)

In [153]:
#column name becomes one of the attribute of the dataframe
df_stock.columns

Index(['Vol', 'Rev', 'Exp', 'Sector', 'EmpCnt', 'HQ', 'MNC', 'StockID', 'GST',
       'Start Date'],
      dtype='object')

In [154]:
# accessing single column
#column name becomes one of the attribute of the dataframe
df_stock.Vol

TCS_Solutions         980
Infosys_Tech          970
Wipro_Services        960
HCL_Tech              950
TechMahindra          940
LT_Infotech           920
Mindtree_Ltd          910
Cognizant_India       995
Mphasis_Ltd           925
Persistent_Systems    945
Name: Vol, dtype: int64

In [158]:
#accessing multiple columns through vector (column labels)
df_stock[['Vol', 'HQ']]

                    Vol   HQ
TCS_Solutions       980  Mum
Infosys_Tech        970  Blr
Wipro_Services      960  Blr
HCL_Tech            950  NCR
TechMahindra        940  Pun
LT_Infotech         920  Mum
Mindtree_Ltd        910  Blr
Cognizant_India     995  Chn
Mphasis_Ltd         925  Blr
Persistent_Systems  945  Pun

In [160]:
df_stock['TCS_Solutions': 'LT_Infotech']

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016

In [169]:
# Direct Access - individual element
df_stock['TechMahindra':'TechMahindra']['EmpCnt']

TechMahindra    146000
Name: EmpCnt, dtype: int64

In [178]:
df_stock[['EmpCnt', 'MNC']]

                    EmpCnt  MNC
TCS_Solutions       500000    1
Infosys_Tech        346000    1
Wipro_Services      250000    1
HCL_Tech            225000    1
TechMahindra        146000    1
LT_Infotech          92000    1
Mindtree_Ltd         38000    1
Cognizant_India     355000    1
Mphasis_Ltd          38000    1
Persistent_Systems   25000    0

In [180]:
df_stock[df_stock.columns]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [181]:
df_stock['Vol']

TCS_Solutions         980
Infosys_Tech          970
Wipro_Services        960
HCL_Tech              950
TechMahindra          940
LT_Infotech           920
Mindtree_Ltd          910
Cognizant_India       995
Mphasis_Ltd           925
Persistent_Systems    945
Name: Vol, dtype: int64

In [182]:
# single dimensional
df_stock['Vol'].shape

(10,)

In [183]:
# vector - 2 dimensional
df_stock[['Vol']].shape

(10, 1)

In [ ]:
#Integer Based Location Access - iloc

In [192]:
print(df_stock.iloc[0, 0])

980

In [193]:
df_stock

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [280]:
df_stock.iloc[2:7, -5]

Wipro_Services    Blr
HCL_Tech          NCR
TechMahindra      Pun
LT_Infotech       Mum
Mindtree_Ltd      Blr
Name: HQ, dtype: object

In [279]:
df_stock.iloc[2:7]['HQ']

Wipro_Services    Blr
HCL_Tech          NCR
TechMahindra      Pun
LT_Infotech       Mum
Mindtree_Ltd      Blr
Name: HQ, dtype: object

In [281]:
df_stock.iloc[2:7].HQ

Wipro_Services    Blr
HCL_Tech          NCR
TechMahindra      Pun
LT_Infotech       Mum
Mindtree_Ltd      Blr
Name: HQ, dtype: object

In [289]:
#Try to execute & understand the concept to retrieve only 
print(df_stock)
df_stock.iloc[1:8:3]         ## 1, 4, 7, 10   - displays first, fourth & seventh row

                    Vol    Rev  Exp Sector  EmpCnt   HQ  MNC StockID  GST  \
TCS_Solutions       980  950.3  700    Pub  500000  Mum    1     TCS   18
Infosys_Tech        970  930.8  690    Pvt  346000  Blr    1    INFY   12
Wipro_Services      960  890.5  680    Pub  250000  Blr    1    WIPR    5
HCL_Tech            950  870.4  670    Pvt  225000  NCR    1    HCLT    5
TechMahindra        940  850.2  665    Pub  146000  Pun    1    TMAH   12
LT_Infotech         920  820.6  655    Gov   92000  Mum    1     LTI   18
Mindtree_Ltd        910  810.8  650    Pvt   38000  Blr    1    MIND   18
Cognizant_India     995  940.7  710    Pub  355000  Chn    1    COGN   12
Mphasis_Ltd         925  830.5  675    Pvt   38000  Blr    1    MPHS    5
Persistent_Systems  945  845.2  685    Gov   25000  Pun    0    PRST    5

                   Start Date
TCS_Solutions        Apr 2004
Infosys_Tech         Jul 1999
Wipro_Services       Dec 2002
HCL_Tech             Aug 2007
TechMahindra         Mar 2009
LT_Infotech          Dec 2016
Mindtree_Ltd         Jan 2018
Cognizant_India      May 2019
Mphasis_Ltd          Sep 2020
Persistent_Systems   Apr 2021

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019

In [304]:
df_stock.iloc[[1,8,3]] # row index (double square bracket - vector representation)

              Vol    Rev  Exp Sector  EmpCnt   HQ  MNC StockID  GST Start Date
Infosys_Tech  970  930.8  690    Pvt  346000  Blr    1    INFY   12   Jul 1999
Mphasis_Ltd   925  830.5  675    Pvt   38000  Blr    1    MPHS    5   Sep 2020
HCL_Tech      950  870.4  670    Pvt  225000  NCR    1    HCLT    5   Aug 2007

In [309]:
# iloc does not allow labelled access
# integer location based access - label is not allowed
df_stock.iloc['Vol']

TypeError: Cannot index by location index with a non-integer key

In [308]:
#Location/Labelled based Access

In [310]:
df_stock

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [311]:
df_stock.loc['HCL_Tech']

Vol                950
Rev              870.4
Exp                670
Sector             Pvt
EmpCnt          225000
HQ                 NCR
MNC                  1
StockID           HCLT
GST                  5
Start Date    Aug 2007
Name: HCL_Tech, dtype: object

In [313]:
df_stock.loc['HCL_Tech', 'EmpCnt']

225000

In [314]:
df_stock.index

Index(['TCS_Solutions', 'Infosys_Tech', 'Wipro_Services', 'HCL_Tech',
       'TechMahindra', 'LT_Infotech', 'Mindtree_Ltd', 'Cognizant_India',
       'Mphasis_Ltd', 'Persistent_Systems'],
      dtype='object')

In [315]:
df_stock.columns

Index(['Vol', 'Rev', 'Exp', 'Sector', 'EmpCnt', 'HQ', 'MNC', 'StockID', 'GST',
       'Start Date'],
      dtype='object')

In [ ]:
#labels = df.index + df.columns - all the above becomes label for the dataframe

In [316]:
df_stock

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Wipro_Services,960,890.5,680,Pub,250000,Blr,1,WIPR,5,Dec 2002
HCL_Tech,950,870.4,670,Pvt,225000,NCR,1,HCLT,5,Aug 2007
TechMahindra,940,850.2,665,Pub,146000,Pun,1,TMAH,12,Mar 2009
LT_Infotech,920,820.6,655,Gov,92000,Mum,1,LTI,18,Dec 2016
Mindtree_Ltd,910,810.8,650,Pvt,38000,Blr,1,MIND,18,Jan 2018
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019
Mphasis_Ltd,925,830.5,675,Pvt,38000,Blr,1,MPHS,5,Sep 2020
Persistent_Systems,945,845.2,685,Gov,25000,Pun,0,PRST,5,Apr 2021

In [319]:
df_stock.loc['LT_Infotech':'Mphasis_Ltd', 'EmpCnt':'GST']

                 EmpCnt   HQ  MNC StockID  GST
LT_Infotech       92000  Mum    1     LTI   18
Mindtree_Ltd      38000  Blr    1    MIND   18
Cognizant_India  355000  Chn    1    COGN   12
Mphasis_Ltd       38000  Blr    1    MPHS    5

In [320]:
df_stock.loc[['TCS_Solutions', 'HCL_Tech', 'Persistent_Systems'], ['Sector', 'MNC', 'EmpCnt']]

                   Sector  MNC  EmpCnt
TCS_Solutions         Pub    1  500000
HCL_Tech              Pvt    1  225000
Persistent_Systems    Gov    0   25000

In [327]:
df_stock.loc[:, 'Sector']

TCS_Solutions         Pub
Infosys_Tech          Pvt
Wipro_Services        Pub
HCL_Tech              Pvt
TechMahindra          Pub
LT_Infotech           Gov
Mindtree_Ltd          Pvt
Cognizant_India       Pub
Mphasis_Ltd           Pvt
Persistent_Systems    Gov
Name: Sector, dtype: object

In [326]:
df_stock.loc[:, ['Sector', 'EmpCnt']]

                   Sector  EmpCnt
TCS_Solutions         Pub  500000
Infosys_Tech          Pvt  346000
Wipro_Services        Pub  250000
HCL_Tech              Pvt  225000
TechMahindra          Pub  146000
LT_Infotech           Gov   92000
Mindtree_Ltd          Pvt   38000
Cognizant_India       Pub  355000
Mphasis_Ltd           Pvt   38000
Persistent_Systems    Gov   25000

In [328]:
df_stock.loc[['TCS_Solutions', 'TechMahindra', 'Mphasis_Ltd'], ['Sector', 'EmpCnt']]

              Sector  EmpCnt
TCS_Solutions    Pub  500000
TechMahindra     Pub  146000
Mphasis_Ltd      Pvt   38000

In [337]:
# conditional access
mask = df_stock.EmpCnt > 300000
df_stock[mask]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Start Date
TCS_Solutions,980,950.3,700,Pub,500000,Mum,1,TCS,18,Apr 2004
Infosys_Tech,970,930.8,690,Pvt,346000,Blr,1,INFY,12,Jul 1999
Cognizant_India,995,940.7,710,Pub,355000,Chn,1,COGN,12,May 2019

In [184]:
!ls -la 1d*

-rw-r--r--@ 1 vidyadharbendre  staff   663 Mar 13 20:38 1d_stock.csv
-rw-r--r--@ 1 vidyadharbendre  staff  2801 Mar 13 20:35 1d_stock.html
-rw-r--r--@ 1 vidyadharbendre  staff  2207 Mar 13 20:36 1d_stock.json
-rw-r--r--@ 1 vidyadharbendre  staff  5763 Mar 13 20:33 1d_stock.xlsx

In [ ]:
pd.rea

In [39]:
df_store = pd.read_csv('df_store.csv')

In [40]:
df_store.head()

   Unnamed: 0 Store   Location  Sales
0           0     A     Mumbai  40000
1           1     B       Pune  45600
2           2     A  Hyderabad  56000
3           3     C     Mumbai  90000
4           4     D       Pune  89000

In [29]:
df_store.tail()

   Unnamed: 0 Store   Location  Sales
5           5     A      Delhi  87000
6           6     D  Hyderabad  85000
7           7     A       Pune  78000
8           8     C     Mumbai  89000
9           9     B       Pune  70000

In [20]:
df_store = pd.read_csv('df_store.csv')

In [21]:
df_store.columns

Index(['Unnamed: 0', 'Store', 'Location', 'Sales'], dtype='object')

In [22]:
df_store.head()

   Unnamed: 0 Store   Location  Sales
0           0     A     Mumbai  40000
1           1     B       Pune  45600
2           2     A  Hyderabad  56000
3           3     C     Mumbai  90000
4           4     D       Pune  89000

In [30]:
df_store.tail()

   Unnamed: 0 Store   Location  Sales
5           5     A      Delhi  87000
6           6     D  Hyderabad  85000
7           7     A       Pune  78000
8           8     C     Mumbai  89000
9           9     B       Pune  70000

In [32]:
df_store.shape

(10, 4)

In [33]:
df_store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10 non-null     int64
 1   Store       10 non-null     object
 2   Location    10 non-null     object
 3   Sales       10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 448.0+ bytes

In [34]:
df_store.describe()

       Unnamed: 0         Sales
count    10.00000     10.000000
mean      4.50000  72960.000000
std       3.02765  19159.401522
min       0.00000  40000.000000
25%       2.25000  59500.000000
50%       4.50000  81500.000000
75%       6.75000  88500.000000
max       9.00000  90000.000000

In [35]:
df_store.columns

Index(['Unnamed: 0', 'Store', 'Location', 'Sales'], dtype='object')

In [36]:
df_store.drop(columns=['Unnamed: 0'], axis=1)

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

In [37]:
df_store = df_store.drop(columns=['Unnamed: 0'], axis=1)

In [38]:
df_store.columns

Index(['Store', 'Location', 'Sales'], dtype='object')

In [41]:
df_store.columns

Index(['Unnamed: 0', 'Store', 'Location', 'Sales'], dtype='object')

In [43]:
df_store.drop(columns=['Unnamed: 0'], axis=1, inplace=True)

In [44]:
df_store.columns

Index(['Store', 'Location', 'Sales'], dtype='object')

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>6. Write a program to display a summary of the basic information about a given data frame<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [6]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})


#d = df_store.describe(include='all')
#print(d)
#print(type(d))

i = df_store.info()
print(i)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Store     10 non-null     object
 1   Location  10 non-null     object
 2   Sales     10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes
None

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>7. Write a program to replace the Store' column, contains the values 'A', 'B', 'C', and 'D' with 'Store_A', Store_B', 'Store_C' and 'Store_D' respectively
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [7]:
# write your code here
import numpy as np

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

df_store['Store'] = df_store['Store'].replace(['A', 'B', 'C', 'D'],['Store_A', 'Store_B', 'Store_C', 'Store_D'])

print(df_store)

     Store   Location  Sales
0  Store_A     Mumbai  40000
1  Store_B       Pune  45600
2  Store_A  Hyderabad  56000
3  Store_C     Mumbai  90000
4  Store_D       Pune  89000
5  Store_A      Delhi  87000
6  Store_D  Hyderabad  85000
7  Store_A       Pune  78000
8  Store_C     Mumbai  89000
9  Store_B       Pune  70000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>8. Create a dataframe in pandas using list and series
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [8]:
# write your code here

countries_name = ['India', 'US', 'UK', 'Australia']    
countries_id = [1, 2, 3, 4] 

df_countries = pd.DataFrame (list(zip(countries_name, countries_id)),
               columns =['Name Of the Country', 'Country Id'])

df_countries


mylist1 = [[10,100,1000],[20,200,2000],[30,300,3000],[40,400,4000],[50,500,5000]]
row_label_list = ['Tata','Birla','Tata','Infy','HCL']
col_label_list = ['Vol','Rev', 'Exp']

df2 = pd.DataFrame(mylist1, columns=col_label_list, index=row_label_list)
print(df2)
print(df2.shape)
print(df2.index)
print(df2.columns)

       Vol  Rev   Exp
Tata    10  100  1000
Birla   20  200  2000
Tata    30  300  3000
Infy    40  400  4000
HCL     50  500  5000
(5, 3)
Index(['Tata', 'Birla', 'Tata', 'Infy', 'HCL'], dtype='object')
Index(['Vol', 'Rev', 'Exp'], dtype='object')

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>9. Save a given dataframe to a csv file
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [9]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

# saving the dataframe 
df_store.to_csv('df_store.csv') 
import os
os.getcwd()

'/Users/vidyadharbendre/workspace/advanced_python/learn_advanced_python_using_examples/notebooks/Advanced'

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>10. Find the maximum sales for each store
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [12]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})
print(df_store)
#DataFrame.min(axis=None, skipna=None, level=None, numeric_only=None, **kwargs)

df_store_group = df_store.groupby('Store')
print(df_store_group.max())

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
      Location  Sales
Store
A         Pune  87000
B         Pune  70000
C       Mumbai  90000
D         Pune  89000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>11. Write a program to select all columns, except 'Ranking_Rate' column in a data frame
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [15]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})


df_store['Rating_Rank'] = df_store['Sales'].rank(ascending = 0)  
#print(df_store)
#print(df_store[['Store', 'Location', 'Sales']])
print(df_store.iloc[:,0:3])

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>12. Write a program to insert a given column at a specific column index in a data frame
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame**<br>
data = {
    'Name': ['Amit Sharma', 'Neha Iyer', 'Rajesh Patel', 'Priya Nair'],
    'Age': [34, 59, 32, 40]
}<br>
df = pd.DataFrame(data=data)<br><br>
**Add the new variable salary as third column**<br>
salary = [35000, 24000, 55000, 40000]

In [77]:
# write your code here

data = {'Name': ['Amit Sharma', 'Neha Iyer', 'Rajesh Patel', 'Priya Nair'], 'Age': [34, 59, 32, 40]}
df = pd.DataFrame(data=data)

salary = [35000, 24000, 55000, 40000]

df['salary'] = salary
print(df)

           Name  Age  salary
0   Amit Sharma   34   35000
1     Neha Iyer   59   24000
2  Rajesh Patel   32   55000
3    Priya Nair   40   40000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>13. Write a program to get the third row of a given data frame
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame**<br>
data = {'Name': ['Amit Sharma', 'Neha Iyer', 'Rajesh Patel', 'Priya Nair'], 'Age': [34, 59, 32, 40]}<br>
df = pd.DataFrame(data=data)<br><br>

In [78]:
# write your code here

data = {'Name': ['Amit Sharma', 'Neha Iyer', 'Rajesh Patel', 'Priya Nair'], 'Age': [34, 59, 32, 40]}
df = pd.DataFrame(data=data)
print(df)


df.iloc[[2]]

           Name  Age
0   Amit Sharma   34
1     Neha Iyer   59
2  Rajesh Patel   32
3    Priya Nair   40

           Name  Age
2  Rajesh Patel   32

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>14. Write a program to create a data frame from a numpy array
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [17]:
# write your code here
import pandas as pd
import numpy as np

np.random.seed(23)
n53 = np.random.randint(low=10, high=100,size=(5,3))

row_label_list = ['Tata','Birla','Tata','Infy','HCL']
col_label_list = ['Vol','Rev', 'Exp']

df2 = pd.DataFrame(n53, index=row_label_list, columns=col_label_list)

print(df2)
print(df2.shape)
print(df2.index)
print(df2.columns)

       Vol  Rev  Exp
Tata    93   50   83
Birla   64   41   86
Tata    49   35   61
Infy    16   55   22
HCL     59   76   85
(5, 3)
Index(['Tata', 'Birla', 'Tata', 'Infy', 'HCL'], dtype='object')
Index(['Vol', 'Rev', 'Exp'], dtype='object')

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>15. Write a programm to count total sales per store
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [18]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

print(df_store)
df_store_group = df_store.groupby('Store')
print(df_store_group.sum())

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
        Sales
Store
A      261000
B      115600
C      179000
D      174000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>16. Write a program to count the most common words in a list
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below list:**<br>
words_list = ['words', 'will', 'where', 'shall', 'we', 'will', 'shall', 'we', 'words', 'where', 'shall'<br>
        'will', 'there', 'wow', 'should', 'shall', 'we', 'where', 'should', 'where', 'will', 'there',<br>
        'now', 'where', 'we', 'will', 'where', 'should', 'will', 'where']

In [19]:
# write your code here

words_list = ['words', 'will', 'where', 'shall', 'we', 'will', 'shall', 'we', 'words', 'where', 'shall'
'will', 'there', 'wow', 'should', 'shall', 'we', 'where', 'should', 'where', 'will', 'there',
'now', 'where', 'we', 'will', 'where', 'should', 'will', 'where']

keys = set(words_list)

keys_list = list(keys)
print(keys_list)

df = pd.DataFrame(data=words_list, columns=['words_list'])
count_list = df['words_list'].value_counts()

print(type(count_list))


df1 = pd.DataFrame(data = count_list)
df1.index
df1.values
df1.columns
df1.shape

print(df1)
print(df1.idxmax())



#def most_frequent(List):
#    return max(set(List), key = List.count)

#count = most_frequent(words_list)

#print(count)

['shallwill', 'there', 'words', 'will', 'where', 'should', 'now', 'shall', 'we', 'wow']
<class 'pandas.core.series.Series'>
           words_list
where               7
will                5
we                  4
shall               3
should              3
words               2
there               2
shallwill           1
wow                 1
now                 1
words_list    where
dtype: object

<a id='sorting'></a>
## 3. Sorting

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>17. Write a program to sort the data frame by 'Sales' in ascending order
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [20]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

print(df_store.sort_values(by='Sales'))

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
9     B       Pune  70000
7     A       Pune  78000
6     D  Hyderabad  85000
5     A      Delhi  87000
4     D       Pune  89000
8     C     Mumbai  89000
3     C     Mumbai  90000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>18. Write a program to sort the data frame, first by 'Store' in ascending order, then by 'Sales' in descending order
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [21]:
# write your code here
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})
df_store.sort_values(by=['Store','Sales'], ascending = (True, False))

  Store   Location  Sales
5     A      Delhi  87000
7     A       Pune  78000
2     A  Hyderabad  56000
0     A     Mumbai  40000
9     B       Pune  70000
1     B       Pune  45600
3     C     Mumbai  90000
8     C     Mumbai  89000
4     D       Pune  89000
6     D  Hyderabad  85000

<a id='ranking'></a>
## 4. Ranking

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>19. Create a column Rating_Rank, which contains the rank of each store based on sales of the product in ascending order
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [22]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

df_store['Rating_Rank'] = df_store['Sales'].rank(ascending = 0)
  
print(df_store)

df_store

  Store   Location  Sales  Rating_Rank
0     A     Mumbai  40000         10.0
1     B       Pune  45600          9.0
2     A  Hyderabad  56000          8.0
3     C     Mumbai  90000          1.0
4     D       Pune  89000          2.5
5     A      Delhi  87000          4.0
6     D  Hyderabad  85000          5.0
7     A       Pune  78000          6.0
8     C     Mumbai  89000          2.5
9     B       Pune  70000          7.0

  Store   Location  Sales  Rating_Rank
0     A     Mumbai  40000         10.0
1     B       Pune  45600          9.0
2     A  Hyderabad  56000          8.0
3     C     Mumbai  90000          1.0
4     D       Pune  89000          2.5
5     A      Delhi  87000          4.0
6     D  Hyderabad  85000          5.0
7     A       Pune  78000          6.0
8     C     Mumbai  89000          2.5
9     B       Pune  70000          7.0

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>20. Rank the data frame in descending order of sales by store
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the 'df_store' data frame**

In [25]:
# write your code here

df_store['Rating_Rank'] = df_store['Sales'].rank(ascending = 0)
df_store.sort_values(by=['Sales'], ascending = (False))

  Store   Location  Sales  Rating_Rank
3     C     Mumbai  90000          1.0
4     D       Pune  89000          2.5
8     C     Mumbai  89000          2.5
5     A      Delhi  87000          4.0
6     D  Hyderabad  85000          5.0
7     A       Pune  78000          6.0
9     B       Pune  70000          7.0
2     A  Hyderabad  56000          8.0
1     B       Pune  45600          9.0
0     A     Mumbai  40000         10.0

In [2]:
import sklearn
print(sklearn.__version__)

1.4.2